           TESTSUITE 'GREETING AND FAREWELL (FAREWELL WILL FAIL)'

           TESTCASE 'TEST WITH HANS'
           MOVE 'Hans' TO WS-NAME
           PERFORM 2000-COMPUTE-GREETING
           EXPECT WS-SALUTE TO BE 'HELLO Hans'
