           TESTSUITE 'Compute greeting. 100% Coverage'

           TESTCASE 'TEST WITH HANS'
           PERFORM 2000-SALUTE
           EXPECT WS-SALUTE TO BE 'HELLO HANS'
