           TESTSUITE 'GREETING AND FAREWELL (FAREWELL WILL FAIL)'

           TESTCASE 'IT RETURNS HELLO, WORLD! AS GREETING'
           MOVE 'Hans' TO WS-NAME
           PERFORM 2000-COMPUTE-GREETING
           EXPECT WS-GREETING-RESULT TO BE 'HELLO Hans'
